wikimedia/smash-pig/PaymentProviders/Adyen/Tests/Data/ipn_RefundedReversed.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><sendNotification xmlns="http://notification.services.adyen.com"><notification><live>false</live><notificationItems><NotificationRequestItem><amount><currency xmlns="http://common.services.adyen.com">EUR</currency><value xmlns="http://common.services.adyen.com">0</value></amount><eventCode>REFUNDED_REVERSED</eventCode><eventDate>2024-04-09T14:43:54+02:00</eventDate><merchantAccountCode>WikimediaDonations</merchantAccountCode><merchantReference>testMerchantRef1</merchantReference><originalReference>pspReference of the REFUNDED_REVERSED</originalReference><pspReference>DQTSKV8Q6479R782</pspReference><reason></reason><success>true</success></NotificationRequestItem></notificationItems></notification></sendNotification></soap:Body></soap:Envelope>
